-- MySQL dump 10.13  Distrib 8.0.27, for Win64 (x86_64)
--
-- Host: localhost    Database: work
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `recipe_composition`
--

DROP TABLE IF EXISTS `recipe_composition`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `recipe_composition` (
  `id` int NOT NULL AUTO_INCREMENT,
  `recipe_id` int NOT NULL,
  `food_name` varchar(20) NOT NULL,
  `quantity` varchar(20) NOT NULL DEFAULT '0',
  `category` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `recipe_composition_food_name_fk` (`food_name`)
) ENGINE=InnoDB AUTO_INCREMENT=272 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='食谱组成表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recipe_composition`
--

LOCK TABLES `recipe_composition` WRITE;
/*!40000 ALTER TABLE `recipe_composition` DISABLE KEYS */;
INSERT INTO `recipe_composition` VALUES (1,1,'鸡蛋','100g','主料'),(2,1,'番茄','200g','主料'),(3,1,'白砂糖','2g','辅料'),(4,1,'食盐','2g','辅料'),(113,2,'茄子','250克','主料'),(114,2,'蒜','5克','辅料'),(115,2,'香菜','1根','辅料'),(116,2,'干辣椒','2克','辅料'),(117,2,'花椒','1克','辅料'),(118,2,'葱','15克','辅料'),(119,2,'白砂糖','50克','辅料'),(120,2,'陈醋','40克','辅料'),(121,2,'生抽','5克','辅料'),(122,2,'盐','2克','辅料'),(123,2,'淀粉','120克','辅料'),(124,3,'鸡胸肉','1块','主料'),(125,3,'紫甘蓝','50克','主料'),(126,3,'黄瓜','1根','主料'),(127,3,'秋葵','1根','主料'),(128,3,'圣女果','适量','主料'),(129,3,'食用油','5毫升','辅料'),(130,3,'胡椒粉','3克','辅料'),(131,3,'盐','3克','辅料'),(132,4,'菲力牛排','1块','主料'),(133,4,'橄榄油','5毫升','辅料'),(134,4,'胡椒酱','适量','辅料'),(135,5,'牛肉','1000克','主料'),(136,5,'白萝卜','500克','主料'),(137,5,'香菇','200克','主料'),(138,5,'朝天椒','6个','辅料'),(139,5,'香菜','2棵','辅料'),(140,5,'姜','1小块','辅料'),(141,5,'蒜','5瓣','辅料'),(142,5,'八角','2个','辅料'),(143,5,'豆瓣酱','20克','辅料'),(144,5,'酱油','10毫升','辅料'),(145,5,'食盐','8克','辅料'),(146,5,'白糖','5克','辅料'),(147,5,'料酒','5毫升','辅料'),(148,5,'食用油','20毫升','辅料'),(149,5,'辣椒粉','5克','辅料'),(150,5,'白芝麻','5克','辅料'),(151,5,'水','1000毫升','辅料'),(152,5,'干辣椒','5克','辅料'),(153,6,'银耳','1个','主料'),(154,6,'红枣','2克','主料'),(155,6,'枸杞','10克','主料'),(156,6,'水','1升','辅料'),(157,6,'冰糖','15克','辅料'),(158,7,'茄子','280克','主料'),(159,7,'猪肉','100克','主料'),(160,7,'姜末','5克','辅料'),(161,7,'葱花','5克','辅料'),(162,7,'蒜片','5克','辅料'),(163,7,'淀粉','30克','辅料'),(164,7,'xo酱','15克','辅料'),(165,7,'盐','2克','辅料'),(166,8,'南瓜','100克','主料'),(167,8,'大米','适量','主料'),(168,8,'水','1.5升','辅料'),(169,9,'冷米饭','1碗','主料'),(170,9,'黄瓜','30克','主料'),(171,9,'胡萝卜','半根','主料'),(172,9,'鸡蛋','1个','主料'),(173,9,'食用油','5毫升','辅料'),(174,9,'生抽','5克','辅料'),(175,9,'盐','3克','辅料'),(176,9,'鸡粉','适量','辅料'),(177,10,'肋排','500克','主料'),(178,10,'花生油','50克','辅料'),(179,10,'葱','适量','辅料'),(180,10,'姜','适量','辅料'),(181,10,'香叶','几片','辅料'),(182,10,'八角','3个','辅料'),(183,10,'冰糖','20克','辅料'),(184,10,'盐','适量','辅料'),(185,11,'烤麸','200克','主料'),(186,11,'香菇','4朵','主料'),(187,11,'木耳(水发)','4-5朵','主料'),(188,11,'黄飞红花生米','数粒','辅料'),(189,11,'六月鲜酱油','1勺','辅料'),(190,11,'六月鲜蚝油','1茶匙','辅料'),(191,11,'老抽','1勺','辅料'),(192,11,'糖','1勺','辅料'),(193,11,'桂皮','1块儿','辅料'),(194,11,'八角','2-3粒','辅料'),(195,11,'清水','小半碗','辅料'),(196,13,'果园鸡','半只','主料'),(197,13,'土豆','500克','主料'),(198,13,'红辣椒','10克','主料'),(199,13,'胡萝卜','20克','主料'),(200,13,'生姜','1块','主料'),(201,13,'蒜瓣','3个','主料'),(202,13,'食用油','10克','辅料'),(203,13,'盐','5克','辅料'),(204,13,'沙茶酱','1汤匙','辅料'),(205,13,'料酒','1汤匙','辅料'),(206,13,'清水','100克','辅料'),(207,14,'豆腐','100克','主料'),(208,14,'胡萝卜','1根','主料'),(209,14,'青辣椒','1根','主料'),(210,14,'食用油','5毫升','辅料'),(211,14,'木耳','30克','辅料'),(212,14,'胡椒粉','2克','辅料'),(213,14,'郫县豆瓣酱','5克','辅料'),(214,14,'生抽','5克','辅料'),(215,14,'盐','3克','辅料'),(216,15,'茄子','250克','主料'),(217,15,'彩椒','50克','辅料'),(218,15,'葱末','5克','辅料'),(219,15,'蒜末','3克','辅料'),(220,15,'食用油','8毫升','辅料'),(221,15,'生抽','3克','辅料'),(222,15,'盐','2克','辅料'),(223,15,'糖','3克','辅料'),(224,16,'莲藕','两节','主料'),(225,16,'洋葱','半个','辅料'),(226,16,'姜末','适量','辅料'),(227,16,'辣椒圈','适量','辅料'),(228,16,'葱末','适量','辅料'),(229,16,'小葱','适量','辅料'),(230,16,'辣椒粉','适量','辅料'),(231,16,'熟白芝麻','适量','辅料'),(232,16,'蚝油','10克','辅料'),(233,16,'五香粉','2克','辅料'),(234,16,'啤酒','50克','辅料'),(235,16,'食盐','少许','辅料'),(236,16,'孜然粉','1克','辅料'),(237,16,'花椒粉','1克','辅料'),(238,16,'绵白糖','10克','辅料'),(239,17,'鸡蛋','4个','主料'),(240,17,'肉末','100克','主料'),(241,17,'食用油','5毫升','辅料'),(242,17,'蒜末','5克','辅料'),(243,17,'生抽','5克','辅料'),(244,17,'葱花','5克','辅料'),(245,17,'胡萝卜','8克','辅料'),(246,17,'香菇末','8克','辅料'),(247,17,'盐','3克','辅料'),(248,18,'雪梨','1个','主料'),(249,18,'冰糖','10克','辅料'),(250,18,'红枣','2个','辅料'),(251,18,'枸杞','5克','辅料'),(252,19,'黄鱼','350克','主料'),(253,19,'葱','15克','辅料'),(254,19,'姜','7克','辅料'),(255,19,'蒜','5克','辅料'),(256,20,'蒜苗','50克','主料'),(257,20,'五花肉','100克','主料'),(258,20,'姜','5克','辅料'),(259,20,'葱','10克','辅料'),(260,20,'蒜','8克','辅料'),(261,12,'瘦肉','250克','主料'),(262,12,'大葱','一根','主料'),(263,12,'胡萝卜','半根','主料'),(264,12,'青瓜',' ','主料'),(265,12,'豆腐皮','两张','主料'),(266,12,'盐','适量','辅料'),(267,12,'花生油','适量','辅料'),(268,12,'生抽','5毫升','辅料'),(269,12,'甜面酱','10克','辅料'),(270,12,'生粉','5克','辅料'),(271,12,'蚝油','5克','辅料');
/*!40000 ALTER TABLE `recipe_composition` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-01-21 18:03:56
